In [1]:
import pandas as pd

In [2]:
data = {
    'Store_ID': [1001, 1002, 1003, 1004, 1005],
    'Store_Name': ['Pet Paradise', 'Animal Kingdom', 'Furry Friends', 'Pet Pals', 'Fauna House'],
    'Location': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Speciality': ['Fish', 'Birds', 'Dogs', 'Cats', 'Reptiles'],
    'Rating': [4.5, 4.2, 3.9, 4.7, 4.0]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

   Store_ID      Store_Name     Location Speciality  Rating
0      1001    Pet Paradise     New York       Fish     4.5
1      1002  Animal Kingdom  Los Angeles      Birds     4.2
2      1003   Furry Friends      Chicago       Dogs     3.9
3      1004        Pet Pals      Houston       Cats     4.7
4      1005     Fauna House      Phoenix   Reptiles     4.0

#### How would you replace all occurrences of 'New York' in the Location column with 'NYC'?

In [8]:
df.replace(to_replace={'Location':'New York'}, value='NYC')

   Store_ID      Store_Name     Location Speciality  Rating
0      1001    Pet Paradise          NYC       Fish     4.5
1      1002  Animal Kingdom  Los Angeles      Birds     4.2
2      1003   Furry Friends      Chicago       Dogs     3.9
3      1004        Pet Pals      Houston       Cats     4.7
4      1005     Fauna House      Phoenix   Reptiles     4.0

#### If you wanted to change ratings of 4.5 to 5, how would you use the replace method for this task?

In [9]:
df.replace(to_replace={'Rating': 4.5}, value=5.0)

   Store_ID      Store_Name     Location Speciality  Rating
0      1001    Pet Paradise     New York       Fish     5.0
1      1002  Animal Kingdom  Los Angeles      Birds     4.2
2      1003   Furry Friends      Chicago       Dogs     3.9
3      1004        Pet Pals      Houston       Cats     4.7
4      1005     Fauna House      Phoenix   Reptiles     4.0

#### How can you replace the speciality 'Dogs' with 'Canines' in the DataFrame?

In [10]:
df.replace(to_replace={'Speciality': 'Dogs'}, value='Canines')

   Store_ID      Store_Name     Location Speciality  Rating
0      1001    Pet Paradise     New York       Fish     4.5
1      1002  Animal Kingdom  Los Angeles      Birds     4.2
2      1003   Furry Friends      Chicago    Canines     3.9
3      1004        Pet Pals      Houston       Cats     4.7
4      1005     Fauna House      Phoenix   Reptiles     4.0

#### If you had a dictionary of old and new store names, how would you apply the replace method to update the store names in the DataFrame?

In [11]:
updated_store_names = {'Pet Paradise' : 'My Pet Paradise', 'Pet Pals' : 'Pet Friends'}

In [13]:
df.replace(to_replace=updated_store_names)

   Store_ID       Store_Name     Location Speciality  Rating
0      1001  My Pet Paradise     New York       Fish     4.5
1      1002   Animal Kingdom  Los Angeles      Birds     4.2
2      1003    Furry Friends      Chicago       Dogs     3.9
3      1004      Pet Friends      Houston       Cats     4.7
4      1005      Fauna House      Phoenix   Reptiles     4.0

#### How would you replace ratings below 4 with a string 'Low Rating'?

In [27]:
df.loc[df['Rating'] < 4.0].loc[:, 'Rating'].tolist()

[3.9]

In [28]:
df.replace(to_replace=df.loc[df['Rating'] < 4.0].loc[:, 'Rating'].tolist(), value='Low Rating')

   Store_ID      Store_Name     Location Speciality      Rating
0      1001    Pet Paradise     New York       Fish         4.5
1      1002  Animal Kingdom  Los Angeles      Birds         4.2
2      1003   Furry Friends      Chicago       Dogs  Low Rating
3      1004        Pet Pals      Houston       Cats         4.7
4      1005     Fauna House      Phoenix   Reptiles         4.0